  /* --------------------  rexx procedure  -------------------- *
  | Name:      zigivchk                                        |
  |                                                            |
  | Function:  Check for an update to ZIGI                     |
  |                                                            |
  | Syntax:    %zigivchk                                       |
  |                                                            |
  | Dependencies: Requires curl                                |
  |                                                            |
  | Author:    Lionel B. Dyck                                  |
  |                                                            |
  | History:  (most recent on top)                             |
  |            2026/07/14 LBD - Clean up and refinement        |
  |            2026/06/27 LBD - Creation                       |
  | ---------------------------------------------------------- |
  |    ZIGI - the z/OS ISPF Git Interface                      |
  |    Copyright (C) 2026 - Henri Kuiper and Lionel Dyck       |
  |                                                            |
  |    This program is free software: you can redistribute it  |
  |    and/or modify it under the terms of the GNU General     |
  |    Public License as published by the Free Software        |
  |    Foundation, either version 3 of the License, or (at     |
  |    your option) any later version.                         |
  |                                                            |
  |    This program is distributed in the hope that it will be |
  |    useful, but WITHOUT ANY WARRANTY; without even the      |
  |    implied warranty of MERCHANTABILITY or FITNESS FOR A    |
  |    PARTICULAR PURPOSE.  See the GNU General Public License |
  |    for more details.                                       |
  |                                                            |
  |    You should have received a copy of the GNU General      |
  |    Public License along with this program.  If not, see    |
  |    <https://www.gnu.org/licenses/>.                        |
  * ---------------------------------------------------------- */

  /* ---------------------------------------- *
  | Get the currently active version of zigi |
  * ---------------------------------------- */
  parse value zigiver() with 'V'v'R'r
  active_version = v'.'r

  /* ---------------------- *
  | Setup ISPF Environment |
  * ---------------------- */
  Address ISPExec
  'vget (zckinfo) profile'
  if zckinfo = ''
  then zckinfo = 'Never'

  /* ------------------------------- *
  | define the bpxwunix environment |
  * ------------------------------- */
  user = userid()
  address syscall ,
    'getpwnam (user) pw.'
  home = pw.pw_dir
  env.0 = 1
  env.1 = 'HOME='home

  /* ----------------------------------------------------- *
  | issue the curl command to get the most recent version |
  | of zigi from github.com/zigi/zigi                     |
  * ----------------------------------------------------- */
  zs1 = 'Performing a check for an updated version if zigi.'
  zs3 = 'Patience please....'
  call do_popup 'x'
  cmd = "curl -s -L" ,
    "-r 0-400" ,     /* only get the 1st 400 bytes */
    "--connect-timeout 5" ,
    "https://raw.githubusercontent.com/zigi/zigi/master/ZIGI.EXEC/ZIGIVER"
  x = bpxwunix(cmd,,s.,e.,env.,1)
  parse value ' ' with zs1 zs2 zs3

  /* ------------------ *
  | Check for 'return' |
  * ------------------ */
  c = 0
  do i = 1 to s.0
    if wordpos('RETURN',translate(s.i)) > 0
    then do
      c = i
      leave
    end
  end
  if c = 0 then do
    zs1 = 'The ZIGI version check was unable to proceed as it'
    zs2 = 'was unable to connect to the GitHub repository.'
    zs3 = 'Last checked' zckinfo
    call do_popup
    exit 4
  end

  /* ------------------- *
  | Now test and report |
  * ------------------- */
  parse value s.c with . "'V"ver"R"rev"'"
  ver = ver'.'rev
  if active_version /= ver then do
    zs1 = 'Your active verison of zigi is' active_version ,
      'with a new version' ver 'available to'
    zs2 = 'download and install.'
    zs3 = 'Last checked' zckinfo
    call do_popup
  end
  else do
    zs1 = 'You are using the most current production version of zigi.'
    zs3 = 'Last checked' zckinfo
    call do_popup
  end
  zckinfo = date() time()
  'vput (zckinfo) profile'
  Exit 0

Do_Popup:
  arg lock
  call pfshow 'off'           /* make sure pfshow is off */
  if lock /= '' then
     'Control Display Lock'
  'Addpop row(4) column(4)'
  'Display Panel(zigipop3)'
  if lock /= '' then
     'Rempop'
  call pfshow 'reset'         /* restore pfshow setting */
  return

  /* ------------------------------------------------------ *
  | The pfshow routine will:                               |
  | 1. check to see the passed option                      |
  | 2. if Off then it will save the current pfshow setting |
  |    - save the current setting                          |
  |    - turn off pfshow                                   |
  | 3. if the option is Reset then it will                 |
  |    - test if pfshow was on and turn it back on         |
  * ------------------------------------------------------ */
pfshow:
  if zpfshow = 'OFF' then return
  arg pfkopt
  if pfkopt = 'RESET' then do
    if pfkeys = 'ON' then
    'select pgm(ispopf) parm(FKA,ON)'
  end
  if pfkopt = 'OFF' then do
    'vget (zpfshow)'
    pfkeys = zpfshow
    if pfkeys /= 'OFF' then
    'select pgm(ispopf) parm(FKA,OFF)'
  end
  return
